blog/2022/05/org-mode-publishing/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-30 Thu 00:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org-Mode Publishing Static Site Generation</title>
<meta name="author" content="kb" />
<meta name="description" content="New New Static site generation with Org-Mode Publishing" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">

<meta name="author" content="Kenny Ballou">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<title>~kb</title>

<link rel="canonical" href="/" />
<link href="/index.xml" rel="alternate" type="application/rss+xml"
      title="~kb/blog" />

<link rel="stylesheet" href="/css/simple.css" />
<link rel="stylesheet" href="/css/simple.add.css" />
<link rel="stylesheet" href="/css/katex.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://kennyballou.com/blog"> UP </a>
 |
 <a accesskey="H" href="https://kennyballou.com/"> HOME </a>
</div><header id="" class="status">
<nav>
  <a href="/">
    <i class="fade fas fa-home"></i>
  </a>
  <a href="/about.html">
    <i class="fade fas fa-user-circle"></i>
  </a>
  <a href="https://git.sr.ht/~kennyballou/"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade far fa-circle fa-1x"></i>
  </a>
  <a href="https://github.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-github fa-1x"></i>
  </a>
  <a href="https://bitbucket.org/kballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-bitbucket fa-1x"></i>
  </a>
  <a href="https://orcid.org/0000-0002-6032-474X"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-orcid"></i>
  </a>
  <a href="https://linkedin.com/in/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-linkedin-in fa-1x"></i>
  </a>
  <a href="/support.html">
    <i class="fade fas fa-heart fa-1x"></i>
  </a>
  <a href="/cv.pdf"
     target="_blank">
    <i class="fade far fa-file-pdf"></i>
  </a>
  <a href="/B74CC4B41148C3DB364BC21182D94B35744E1B34.asc"
     target="_blank">
    <i class="fade fas fa-key"></i>
  </a>
  <a href="/index.xml" rel="alternate"
     type="application/rss+xml">
    <i class="fade fas fa-rss fa-1x"></i>
  </a>
</nav>
</header>
<div id="main" class="content">
<h1 class="title">Org-Mode Publishing Static Site Generation</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6fe5b29">Motivation</a></li>
<li><a href="#org5438db9">Some Emacs Lisp</a>
<ul>
<li><a href="#org73e4d02">Preamble and Postamble</a></li>
<li><a href="#orgcd21cf9">Simple CSS Preamble + Postamble</a></li>
<li><a href="#org2777b4c"><code>ox-rss</code></a></li>
</ul>
</li>
<li><a href="#org4bcbdf0">Building and Publishing</a>
<ul>
<li><a href="#org0c143fe">Make</a></li>
<li><a href="#org14b4e1f">GitHub Actions</a></li>
</ul>
</li>
<li><a href="#org43c940f">Parting Thoughts</a></li>
</ul>
</div>
</div>
<div class="preview" id="org0031ed9">
<p>
<a href="https://kennyballou.com/blog/2019/03/static-site-generation/index.html">Previously</a>, I discussed changing the generation of this site.  Specifically,
using <a href="https://orgmode.org/">Org-Mode</a> files with <a href="https://pandoc.org/">Pandoc</a> and some <a href="https://www.gnu.org/software/bash/">Bash</a> scripts to generate the site.
However, today, I have changed the site again.  Now, the site is generated
entirely using <a href="https://orgmode.org/">Org-Mode</a>.
</p>

</div>

<p>
The Intertubes overflow with <a href="https://systemcrafters.net/publishing-websites-with-org-mode/automated-site-publishing/">previous</a> <a href="https://ogbe.net/blog/blogging_with_org.html">posts</a> about static site generation or
blogging with only <a href="https://orgmode.org/">Org Mode</a>.  I focus mainly on a few details to make things
work here.  But first, motivation.  Why change.
</p>

<div id="outline-container-org6fe5b29" class="outline-2">
<h2 id="org6fe5b29">Motivation</h2>
<div class="outline-text-2" id="text-org6fe5b29">
<p>
I wanted to transition the blog into a more general purpose site and I felt my
hand-rolled generation would not be adequate.  I did not want to go back to
bigger tools like <a href="https://gohugo.io/">Hugo</a> and friends.  While these would certainly be capable,
remaining in <a href="https://orgmode.org/">Org</a> and <a href="https://gnu.org/software/emacs">Emacs</a> seemed like the "winning" move.
</p>

<p>
I also switched from using my own <a href="https://ethanschoonover.com/solarized/">Solarized</a> CSS, to <a href="https://simplecss.org/">Simple CSS</a>.
</p>

<p>
A nice benefit of this change is automatic table of contents generated for each
post and easily disabled for pages where table of contents do not make sense.
Another benefit was learning that many of the links in the previous posts were
broken.  <a href="https://orgmode.org/manual/Publishing.html">Publishing</a> does not generate sites with broken links.
</p>
</div>
</div>

<div id="outline-container-org5438db9" class="outline-2">
<h2 id="org5438db9">Some Emacs Lisp</h2>
<div class="outline-text-2" id="text-org5438db9">
<p>
Defining an <a href="https://orgmode.org/">Org</a> project is fairly straightforward, but some parameters to the
publishing projects depend on the circumstance.
</p>
</div>

<div id="outline-container-org73e4d02" class="outline-3">
<h3 id="org73e4d02">Preamble and Postamble</h3>
<div class="outline-text-3" id="text-org73e4d02">
<p>
To handle the headers and footers of the site, I defined the following function
to read in, now modified versions of, the previous header and footer HTML
content.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">read-template</span> (filename)
  <span style="font-style: italic;">"Read template contents from FILENAME."</span>
  (<span style="font-weight: bold;">with-temp-buffer</span>
    (insert-file-contents filename)
    (buffer-string)))
</pre>
</div>

<p>
Then, this function can be used to load in the content of the template files:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">setq</span> head-extra-template (read-template <span style="font-style: italic;">"templates/html_header.html"</span>))
(<span style="font-weight: bold;">setq</span> header-template (read-template <span style="font-style: italic;">"templates/html_sub_header.html"</span>))
(<span style="font-weight: bold;">setq</span> header-nav (read-template <span style="font-style: italic;">"templates/nav.html"</span>))
(<span style="font-weight: bold;">setq</span> footer-template (read-template <span style="font-style: italic;">"templates/html_footer.html"</span>))
</pre>
</div>

<p>
Then for each project, the following keys are set:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold;">:html-head-extra</span> head-extra-template
<span style="font-weight: bold;">:html-preamble</span> header-nav
<span style="font-weight: bold;">:html-postamble</span> footer-template
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd21cf9" class="outline-3">
<h3 id="orgcd21cf9">Simple CSS Preamble + Postamble</h3>
<div class="outline-text-3" id="text-orgcd21cf9">
<p>
To get the preamble and postamble to be styled right by <a href="https://simplecss.org/">SimpleCSS</a>, the
following keys were necessary:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold;">:html-divs</span> '((preamble <span style="font-style: italic;">"header"</span> <span style="font-style: italic;">""</span>)
             (content <span style="font-style: italic;">"div"</span> <span style="font-style: italic;">"main"</span>)
             (postamble <span style="font-style: italic;">"footer"</span> <span style="font-style: italic;">""</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2777b4c" class="outline-3">
<h3 id="org2777b4c"><code>ox-rss</code></h3>
<div class="outline-text-3" id="text-org2777b4c">
<p>
To publish the RSS feed, I needed to copy the <a href="https://github.com/kennyballou/kennyballou.github.io/blob/31878715d1f29ab9c95c31b9d9d713db74dabfba/lisp/ox-rss.el"><code>ox-rss.el</code></a> file wholesale so that
it was accessible during the automated publishing.
</p>
</div>
</div>
</div>

<div id="outline-container-org4bcbdf0" class="outline-2">
<h2 id="org4bcbdf0">Building and Publishing</h2>
<div class="outline-text-2" id="text-org4bcbdf0">
</div>

<div id="outline-container-org0c143fe" class="outline-3">
<h3 id="org0c143fe">Make</h3>
<div class="outline-text-3" id="text-org0c143fe">
<p>
With the <code>build-site.el</code> file defined, the <a href="https://www.gnu.org/software/make/">Make target</a> is quite simple.
</p>

<div class="org-src-container">
<pre class="src src-GNUMakefile">.PHONY: org-publish
org-publish:
	emacs -Q --script ./build-site.el
</pre>
</div>
</div>
</div>

<div id="outline-container-org14b4e1f" class="outline-3">
<h3 id="org14b4e1f">GitHub Actions</h3>
<div class="outline-text-3" id="text-org14b4e1f">
<p>
In an earlier <a href="https://kennyballou.com/blog/2020/02/blog-deploy-code-commit-and-build/index.html">post</a>, I described using <a href="https://aws.amazon.com/codebuild/">AWS CodeBuild</a> to automatically build site
content and copy the files to <a href="https://aws.amazon.com/s3">S3</a>.  However, after one timed-out build attempted
to put 15 GB of useless files into my <a href="https://aws.amazon.com/s3">S3</a> bucket and caused over 400,000
requests against the bucket, it was time to try something new.
</p>

<p>
While hosting with <a href="https://aws.amazon.com/s3">S3</a> and <a href="https://aws.amazon.com/cloudfront">CloudFront</a> is cheap, hosting with <a href="https://pages.github.com/">GitHub Pages</a> is
free.  More than that, if I ever write something people are interested in, I do
not need to worry about my <a href="https://aws.amazon.com/cloudfront">CloudFront</a> costs ballooning out of control.
</p>

<blockquote>
<p>
Of course, this is not a real worry.  CloudFront has only cost about $0.01 for
a while, sometimes less.
</p>
</blockquote>

<p>
The process of setting this up is straightforward and more up-to-date
documentation is available from <a href="https://github.com/">GitHub</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-org43c940f" class="outline-2">
<h2 id="org43c940f">Parting Thoughts</h2>
<div class="outline-text-2" id="text-org43c940f">
<p>
Nothing is perfect, but overall, I am pleased with the result of switching to
using <a href="https://orgmode.org/">Org Mode</a> for publishing.  There exists a learning curve&#x2013; as with all
things&#x2013; however, not needing to develop and maintain the publishing scripts to
the degree the custom rolled solution required is a relief.  It may require
<i>some</i> code to develop a new section or something else.  But not nearly to the
degree the old method required.
</p>

<p>
Certainly, changing the hosting was not intended.  I started the publishing
change with the intent that it would still be hosted with <a href="https://aws.amazon.com/cloudfront">AWS CloudFront</a> and
<a href="https://aws.amazon.com/s3">AWS S3</a>.  Unfortunately, the build issues described above and my own second
guessing the rationale for hosting with <a href="https://aws.amazon.com/">AWS</a> persuaded me to switch.
</p>
</div>
</div>
</div>
<footer id="" class="status">
<footer>
  <p>&copy; 2014-2024 Kenny Ballou.
    <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Some rights
      reserved.</a></p>
  <p>Powered by <a href="https://gnu.org">GNU/Linux</a></p>
</footer>
</footer>
</body>
</html>
